alibaba/AliOS-Things/platform/mcu/r5f565ne/hal/r_flash_rx_v3.20/r_flash_rx/src/r_flash_fcu.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_flash_fcu.c
* Description  : This module implements functions common to Flash Types 3 and 4.
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.10.2016 1.00    First Release
*              : 06.02.2017 1.10    Added support for RX65N-2M (bank/application swap).
*                                   Added code to clear ECC flag in flash_fcuram_codecopy();
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <string.h>     // memcpy()
#include "r_flash_rx_if.h"
#include "r_flash_fcu.h"
#include "r_flash_group.h"
#if (FLASH_TYPE == FLASH_TYPE_3)
#include "r_flash_type3_if.h"
#endif

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
External functions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

#ifdef FLASH_HAS_FCU

/***********************************************************************************************************************
 * Function Name: flash_init_fcu
 * Description  : This function sets the flash clock and copies FCU firmware to RAM
 *                (if supported).
 * Arguments    : none
 * Return Value : FLASH_SUCCESS -
 *                    Peripheral Initialized successfully.
 *                FLASH_ERR_TIMEOUT
 *                    Timed out trying to copy firmware to RAM
 ***********************************************************************************************************************/
flash_err_t flash_init_fcu(void)
{
    flash_err_t err = FLASH_SUCCESS;
    uint32_t fclk = MCU_CFG_FCLK_HZ;

    g_current_parameters.current_operation = FLASH_CUR_FCU_INIT;

    /* Allow Access to the Flash registers */
    FLASH.FWEPROR.BYTE = 0x01;

    /* Let the sequencer know what FCLK is running at */
    R_FLASH_Control(FLASH_CMD_CONFIG_CLOCK, &fclk);

    /* Copy the FCU firmware to FCU RAM */
#if (FLASH_TYPE == FLASH_TYPE_3)
    err = flash_fcuram_codecopy();
#endif
    return err;
}

#if (FLASH_TYPE == FLASH_TYPE_3)
/***********************************************************************************************************************
 * Function Name: flash_fcuram_codecopy
 * Description  : This function copies FCU firmware to the FCURAM.
 * Arguments    : none
 * Return Value : FLASH_SUCCESS -
 *                    Code copied successfully.
 *                FLASH_ERR_TIMEOUT
 *                  Timed out while attempting to switch to P/E mode or while trying to issue a STOP or
 *                   an ongoing flash operation timed out.
 *                FLASH_ERR_LOCKED
 *                 Switch to Read mode timed out and STOP was attempted to recover. Stop operation failed.
 *                 Peripheral in locked state.
 *                FLASH_ERR_FAILURE
 *                 Unable to enter PE mode
 ***********************************************************************************************************************/
flash_err_t flash_fcuram_codecopy(void)
{
    uint8_t * p_src;
    uint8_t * p_dest;
    volatile int32_t wait_cnt;      // Timeout counter.
    flash_err_t err = FLASH_SUCCESS;

