alibaba/AliOS-Things/platform/mcu/r5f565ne/hal/r_flash_rx_v3.20/r_flash_rx/src/r_flash_fcu.c
    return err;
}


/***********************************************************************************************************************
 * Function Name: flash_wait_frdy
 * Description  : Function
 * Arguments    : None.
 * Return Value : FLASH_SUCCESS -
 *                    Switched successfully.
 *                FLASH_ERR_TIMEOUT -
 *                    Operation timed out. Ongoing flash operation failed.
 *                FLASH_ERR_LOCKED -
 *                    Peripheral in locked state. Operation failed.
 ***********************************************************************************************************************/
flash_err_t flash_wait_frdy(void)
{
    flash_err_t err = FLASH_SUCCESS;
    
    
    while (1 != FLASH.FSTATR.BIT.FRDY)
    {
        if (g_current_parameters.wait_cnt-- <= 0)
        {
            flash_stop();
            err = FLASH_ERR_TIMEOUT;
        }
    }

    /* Check if Command Lock bit is set */
    if (err == FLASH_SUCCESS)
    {
        if (0 != FLASH.FASTAT.BIT.CMDLK)
        {
            err = get_cmdlk_err();
        }
    }

    return err;
}


/***********************************************************************************************************
* Function Name: flash_get_status
* Description  : Returns the current state of the flash
*                NOTE1: This function does not have to execute from in RAM. It must be in RAM though if
*                CF BGO is enabled and this function is called during a ROM P/E operation.
* Arguments    : none
* Return Value : FLASH_SUCCESS -
*                    Flash is ready to use
*                FLASH_ERR_BUSY -
*                    Flash is busy with another operation or is uninitialized
***********************************************************************************************************/
flash_err_t flash_get_status (void)
{
    /* Return flash status */
    if( g_flash_state == FLASH_READY )
    {
        return FLASH_SUCCESS;
    }
    else
    {
        return FLASH_ERR_BUSY;
    }
}


/***********************************************************************************************************************
 * Function Name: flash_erase
 * Description  : Function erases a block of Code or Data Flash
 * Arguments    : block address -
 *                    Block address to start erasing from
 *                num_blocks -
 *                    Number of blocks to erase in ascending order (descending addresses)
 * Return Value : FLASH_SUCCESS -
 *                    Block Erased successfully.
 *                FLASH_ERR_TIMEOUT -
 *                    Erase operation timed out. The function issued a STOP to reset the peripheral.
 *                FLASH_ERR_LOCKED -
 *                    Erase operation timed out and STOP was attempted to recover. Stop operation failed.
 *                    Peripheral in locked state.
 *                FLASH_ERR_LOCKBIT_SET -
 *                    Failed while trying to erase a block because lockbit was set and lockbit protection was enabled
 *                FLASH_ERR_FAILURE -
 *                    Erase operation failed for some other reason
 ***********************************************************************************************************************/
flash_err_t flash_erase(uint32_t block_address, uint32_t num_blocks)
{
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    uint32_t    size_boundary;
#endif
    flash_err_t err = FLASH_SUCCESS;


    /* Set Erasure Priority Mode */
    FLASH.FCPSR.WORD = 0x0001;

    /* LOOP THROUGH EACH BLOCK */
    for (g_current_parameters.current_count = 0;
      g_current_parameters.current_count < g_current_parameters.total_count;
      g_current_parameters.current_count++)
    {
        /* Init flash register and write fcu erase block command */
        FLASH.FSADDR.LONG = g_current_parameters.dest_addr;
        *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_BLOCK_ERASE;
        *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

        /* Return if in BGO mode. Processing will finish in FRDYI interrupt */
        if ((g_current_parameters.current_operation == FLASH_CUR_CF_BGO_ERASE)
         || (g_current_parameters.current_operation == FLASH_CUR_DF_BGO_ERASE))
        {
            break;
        }

        /* In blocking mode, wait for FRDY or timeout. Return if error. */
        err = flash_wait_frdy();
        if (err != FLASH_SUCCESS)
        {
            break;
        }

        /* Adjust timeout and address for next block */
        if (FLASH.FENTRYR.WORD == 0x0080)
        {
#ifndef FLASH_NO_DATA_FLASH
            /* DATA FLASH */
            g_current_parameters.dest_addr += FLASH_DF_BLOCK_SIZE;
            g_current_parameters.wait_cnt = WAIT_MAX_ERASE_DF;
#endif
        }
        else // (FLASH.FENTRYR.WORD == 0x0001)
        {
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
            size_boundary = (uint32_t)FLASH_CF_BLOCK_7;     // for linear and hi-bank dual mode
#ifdef FLASH_IN_DUAL_BANK_MODE
            if (g_current_parameters.dest_addr <= (uint32_t)FLASH_CF_LO_BANK_HI_ADDR)
            {
                size_boundary = (uint32_t)FLASH_CF_BLOCK_45;
            }
#endif

            /* CODE FLASH */
            if (g_current_parameters.dest_addr <= size_boundary)
            {
                g_current_parameters.dest_addr -= FLASH_CF_MEDIUM_BLOCK_SIZE;
                g_current_parameters.wait_cnt = WAIT_MAX_ERASE_CF_32K;
            }
            else
            {
                g_current_parameters.dest_addr -= FLASH_CF_SMALL_BLOCK_SIZE;
                g_current_parameters.wait_cnt = WAIT_MAX_ERASE_CF_8K;
            }
#endif
        }
    }

    return err;
}

#ifndef FLASH_NO_BLANK_CHECK
/***********************************************************************************************************************
 * Function Name: flash_blankcheck
 * Description  : Function checks if the specified Data Flash address range is blank
 * Arguments    : address -
 *                    Start address to perform blank check. Actual address or entry from "flash_block_address_t" enum can be used
 *                num_bytes -
 *                    Number of bytes to perform blank check operation for.
 *                *result
 *                    Set to FLASH_RES_NOT_BLANK or FLASH_RES_BLANK.
 * Return Value : FLASH_SUCCESS -
 *                    Operation completed (blocking) or started successfully (BGO)
 *                FLASH_ERR_TIMEOUT -
 *                    Operation timed out. The function issued a STOP to reset the peripheral.
 *                FLASH_ERR_LOCKED -
 *                    Peripheral in locked state.
 *                FLASH_ERR_FAILURE -
 *                    Operation failure
 ***********************************************************************************************************************/
flash_err_t flash_blankcheck(uint32_t start_address, uint32_t num_bytes, flash_res_t *result)
{
    flash_err_t err = FLASH_SUCCESS;

