alibaba/AliOS-Things/platform/mcu/r5f565ne/hal/r_flash_rx_v3.20/r_flash_rx/src/r_flash_fcu.c
    /* Init flash registers and write fcu command */
    FLASH.FBCCNT.BYTE = 0x00;       // set mode to incremental
    FLASH.FSADDR.LONG = start_address;
    FLASH.FEADDR.LONG = (start_address + num_bytes - 1);
    *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_BLANK_CHECK;
    *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

    /* In blocking mode, wait for FRDY or timeout */
    if (g_current_parameters.bgo_enabled_df == false)
    {
        err = flash_wait_frdy();
        if (err == FLASH_SUCCESS)
        {
            /* Load blank status */
            if (FLASH.FBCSTAT.BYTE == 0x01)
            {
                *result = FLASH_RES_NOT_BLANK;
            }
            else
            {
                *result = FLASH_RES_BLANK;
            }
        }
    }

    return err;
}
#endif // #ifndef FLASH_NO_BLANK_CHECK


/***********************************************************************************************************************
 * Function Name: flash_write
 * Description  : This function writes to Code or Data Flash
 * Arguments    : src_address -
 *                    Source buffer address.
 *                dest_address -
 *                    Destination address.
 *                num_bytes
 *                    Number of bytes to be written
 * Return Value : FLASH_SUCCESS -
 *                    Write completed successfully; successfully initialized in case of BGO mode.
 *                FLASH_ERR_BYTES -
 *                    Number of bytes exceeds max range or is 0 or is not a valid multiple of the minimum programming
 *                    size for the specified flash
 *                FLASH_ERR_ADDRESS -
 *                    src/dest address is an invalid Code/Data Flash block start address or
 *                    address is not aligned with the minimum programming size for the Code/Data Flash
 *                    For Code Flash programming the src address HAS to be a RAM address since ROM cannot be accessed
 *                    during Code Flash programming
 *                FLASH_ERR_BUSY -
 *                    Flash peripheral is busy with another operation or not initialized
 *                FLASH_ERR_CMD_LOCKED -
 *                    The FCU entered a command locked state and cannot process the operation.
 *                    A RESET was performed on the FCU to recover from this state.
 *                FLASH_ERR_LOCKBIT_SET
 *                    Operation failed because the lockbit was set.
 *                    A RESET was performed on the FCU to recover from this state.
 *                FLASH_ERR_FAILURE
 *                    Code Flash Write operation attempted in BGO mode. This is temporarily not supported
 *                    Operation failed for some other reason; RESET was performed on the FCU to recover from this state.
 ***********************************************************************************************************************/
flash_err_t flash_write(uint32_t src_start_address,
                        uint32_t dest_start_address,
                        uint32_t num_bytes)
{
    flash_err_t err = FLASH_SUCCESS;
    uint32_t wait_cnt;


    g_current_parameters.total_count = (num_bytes) >> 1;    // two bytes written at a time
    g_current_parameters.dest_addr = dest_start_address;
    g_current_parameters.src_addr = src_start_address;
    g_current_parameters.current_count = 0;
    if (g_current_parameters.current_operation == FLASH_CUR_CF_WRITE)
    {
        wait_cnt = WAIT_MAX_ROM_WRITE;
    }
#ifndef FLASH_NO_DATA_FLASH
    else
    {
        wait_cnt = WAIT_MAX_DF_WRITE;
    }
#endif


    /* TOTAL NUMBER OF BYTES TO WRITE LOOP */
    while (g_current_parameters.total_count > 0)
    {
        /* Setup fcu command */
        FLASH.FSADDR.LONG = g_current_parameters.dest_addr;
        *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_PROGRAM;
        *g_pfcu_cmd_area = (uint8_t) g_current_parameters.fcu_min_write_cnt;

        /* MINIMUM FLASH WRITE SIZE LOOP (2 BYTES AT A TIME DUE TO FCU BUFFER SIZE) */
        while (g_current_parameters.current_count++ < g_current_parameters.fcu_min_write_cnt)
        {
            /* Copy data from source address to destination area */
            *(FCU_WORD_PTR) g_pfcu_cmd_area = *(uint16_t *) g_current_parameters.src_addr;

            while (FLASH.FSTATR.BIT.DBFULL == 1)    // wait for fcu buffer to empty
                ;

            g_current_parameters.src_addr += 2;
            g_current_parameters.dest_addr += 2;
            g_current_parameters.total_count--;
        }

        /* Issue write end command */
        *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

        /* Reset fcu write count */
        g_current_parameters.current_count = 0;

        /* Return if in BGO mode. Processing will finish in FRDYI interrupt */
        if ((g_current_parameters.current_operation == FLASH_CUR_CF_BGO_WRITE)
         || (g_current_parameters.current_operation == FLASH_CUR_DF_BGO_WRITE))
        {
            break;
        }

        /* In blocking mode, wait for FRDY or timeout. Return if error. */
        err = flash_wait_frdy();
        if (err != FLASH_SUCCESS)
        {
            break;
        }

        /* Reload timeout for next minimum flash write size */
        g_current_parameters.wait_cnt = wait_cnt;
    }

  return err;
}

#if (FLASH_CFG_CODE_FLASH_BGO || FLASH_CFG_DATA_FLASH_BGO)
/***********************************************************************************************************************
 * Function Name: Excep_FCU_FRDYI
 * Description  : ISR for Flash Ready Interrupt
 * Arguments    : none
 * Return Value : none
 ***********************************************************************************************************************/
#pragma interrupt Excep_FCU_FRDYI(vect=VECT(FCU,FRDYI))
static void Excep_FCU_FRDYI(void)
{
#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
    uint32_t    size_boundary;
#endif

    if ((FLASH_CUR_DF_BGO_WRITE == g_current_parameters.current_operation)
     || (FLASH_CUR_CF_BGO_WRITE == g_current_parameters.current_operation))
    {
        /* If there are still bytes to write */
        if (g_current_parameters.total_count > 0)
        {
            /* Setup fcu command */
            FLASH.FSADDR.LONG = g_current_parameters.dest_addr;
            *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_PROGRAM;
            *g_pfcu_cmd_area = (uint8_t) g_current_parameters.fcu_min_write_cnt;

