alibaba/AliOS-Things/platform/mcu/r5f565ne/hal/r_flash_rx_v3.20/r_flash_rx/src/r_flash_fcu.c
            /* MINIMUM FLASH WRITE SIZE LOOP (2 BYTES AT A TIME DUE TO FCU BUFFER SIZE) */
            while (g_current_parameters.current_count++ < g_current_parameters.fcu_min_write_cnt)
            {
                /* Copy data from source address to destination area */
                *(FCU_WORD_PTR) g_pfcu_cmd_area =   *(uint16_t *) g_current_parameters.src_addr;

                while (FLASH.FSTATR.BIT.DBFULL == 1)    // wait for fcu buffer to empty
                    ;

                g_current_parameters.src_addr += 2;
                g_current_parameters.dest_addr += 2;
                g_current_parameters.total_count--;
            }

            /* Issue write end command */
            *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

            /* Reset fcu write count */
            g_current_parameters.current_count = 0;

            /* Exit ISR until next FRDY interrupt to continue operation (write next min size) */
            return;
        }
        /* Done writing all bytes */
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_WRITE_COMPLETE;
        }
    }


    else if ((FLASH_CUR_DF_BGO_ERASE == g_current_parameters.current_operation)
     || (FLASH_CUR_CF_BGO_ERASE == g_current_parameters.current_operation))
    {
        g_current_parameters.current_count++;
        if (g_current_parameters.current_count < g_current_parameters.total_count)
        {
            /* Increment to next block address */
#ifndef FLASH_NO_DATA_FLASH
            /* DATA FLASH */
            if (FLASH.FENTRYR.WORD == 0x0080)
            {
                g_current_parameters.dest_addr += FLASH_DF_BLOCK_SIZE;
            }
#endif

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
            /* CODE FLASH */
            if (FLASH.FENTRYR.WORD == 0x0001)
            {
                size_boundary = (uint32_t)FLASH_CF_BLOCK_7;     // for linear and hi-bank dual mode
#ifdef FLASH_IN_DUAL_BANK_MODE
                if (g_current_parameters.dest_addr <= (uint32_t)FLASH_CF_LO_BANK_HI_ADDR)
                {
                    size_boundary = (uint32_t)FLASH_CF_BLOCK_45;
                }
#endif
                if (g_current_parameters.dest_addr <= size_boundary)
                {
                    g_current_parameters.dest_addr -= FLASH_CF_MEDIUM_BLOCK_SIZE;
                }
                else
                {
                    g_current_parameters.dest_addr -= FLASH_CF_SMALL_BLOCK_SIZE;
                }
            }
#endif

            /* Init flash register and write fcu erase block command */
            FLASH.FSADDR.LONG = g_current_parameters.dest_addr;
            *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_BLOCK_ERASE;
            *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

            /* Exit ISR until next FRDY interrupt to continue operation (erase next block) */
            return;
        }
        /* Done erasing all blocks */
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_ERASE_COMPLETE;
        }
    }


#ifndef FLASH_NO_BLANK_CHECK
    else if (FLASH_CUR_DF_BGO_BLANKCHECK == g_current_parameters.current_operation)
    {
        if (FLASH.FBCSTAT.BYTE == 0x01)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_NOT_BLANK;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_BLANK;
        }
    }
#endif

#if (FLASH_HAS_SEQUENTIAL_CF_BLOCKS_LOCK && FLASH_CFG_CODE_FLASH_ENABLE)
    else if (FLASH_CUR_CF_BGO_READ_LOCKBIT == g_current_parameters.current_operation)
    {
        if (FLASH.FLKSTAT.BIT.FLOCKST == 1)
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_LOCKBIT_NON_PROTECTED;
        }
        else
        {
            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_LOCKBIT_PROTECTED;
        }
    }
    else if (FLASH_CUR_CF_BGO_WRITE_LOCKBIT == g_current_parameters.current_operation)
    {
        if (0 == FLASH.FASTAT.BIT.CMDLK)    // last block lock successful
        {
            while (++g_current_parameters.current_count < g_current_parameters.total_count)
            {
                /* Decrement to start address of next CF block */
                if (g_current_parameters.dest_addr <= (uint32_t) FLASH_CF_BLOCK_7)
                {
                    g_current_parameters.dest_addr -= FLASH_CF_MEDIUM_BLOCK_SIZE;
                }
                else
                {
                    g_current_parameters.dest_addr -= FLASH_CF_SMALL_BLOCK_SIZE;
                }

                /* Init flash registers and write fcu command */
                FLASH.FSADDR.LONG = g_current_parameters.dest_addr;
                *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_LOCK_BIT_PGM;
                *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FINAL;

                /* Exit ISR until next FRDY interrupt to continue operation (lock next block) */
                return;
            }

            g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_LOCKBIT_WRITTEN;
        }
        else /* writing lockbit failed */
        {
            flash_reset();
            g_flash_int_error_cb_args.event = FLASH_INT_EVENT_ERR_FAILURE;
        }
    }
#endif

#if (FLASH_HAS_CF_ACCESS_WINDOW && FLASH_CFG_CODE_FLASH_ENABLE)
    else if (FLASH_CUR_CF_ACCESSWINDOW == g_current_parameters.current_operation)
    {
        g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_SET_ACCESSWINDOW;
    }
#endif

#if (FLASH_HAS_BOOT_SWAP && FLASH_CFG_CODE_FLASH_ENABLE)
    else if (FLASH_CUR_CF_TOGGLE_STARTUPAREA == g_current_parameters.current_operation)
    {
        g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_TOGGLE_STARTUPAREA;
    }
#endif

#if (FLASH_HAS_APP_SWAP && FLASH_CFG_CODE_FLASH_ENABLE)
    else if (FLASH_CUR_CF_TOGGLE_BANK == g_current_parameters.current_operation)
    {
        g_flash_int_ready_cb_args.event = FLASH_INT_EVENT_TOGGLE_BANK;
    }
#endif


    if (g_current_parameters.current_operation != FLASH_CUR_STOP)
    {
        flash_pe_mode_exit();
        flash_release_state();

        if ((FIT_NO_FUNC != flash_ready_isr_handler)
         && (NULL != flash_ready_isr_handler))
        {
            flash_ready_isr_handler((void *) &g_flash_int_ready_cb_args);
        }
    }
}


/***********************************************************************************************************************
 * Function Name: Excep_FCU_FIFERR
 * Description  : ISR for Flash Error Interrupt
 * Arguments    : none
 * Return Value : none
 ***********************************************************************************************************************/
#pragma interrupt Excep_FCU_FIFERR(vect=VECT(FCU,FIFERR))
static void Excep_FCU_FIFERR(void)
{
    /* Check if Command Lock bit is set */
    if (1 == FLASH.FASTAT.BIT.CMDLK)
    {
        g_flash_int_error_cb_args.event = get_cmdlk_err_event();
    }

    /* Reset the FCU: This will stop any existing processes and exit PE mode */
    flash_reset();

    IR(FCU,FRDYI)= 0;  //Clear any pending Flash Ready interrupt request

    flash_release_state();

    if ((FIT_NO_FUNC != flash_error_isr_handler)
     && (NULL != flash_error_isr_handler))
    {
        flash_error_isr_handler((void *) &g_flash_int_error_cb_args);
    }
}

#endif // (FLASH_CFG_CODE_FLASH_BGO || FLASH_CFG_DATA_FLASH_BGO)

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#pragma section
#endif

#endif // FLASH_HAS_FCU
